ex) 
관련이 높은 거 ->  상관계수 비교 corr

## [ 접근자 accessor ]
- Series/DataFrame의 데이터가 날짜시간(datetime), 문자열(object), 범주형(Category)등의 경우 데이터 타입과 관련된 전용의 함수들을 사용할 수 있도록 해주는 속성.
- Series.str.문자열처리관련함수명()
- Series.dt.날짜시간처리관련속성명

(1) 모듈 로딩 <hr>

In [1]:
import pandas as pd
import numpy as np

(2) 데이터 준비 <hr>

In [2]:
datas = {'name':["홍 길동", "이 나영", "마 징가", "베 토벤"], 
         'age':[10, 21, 73, 89],
         'reg_date':['2000/01/23', '2020/11/08', '1999/5/4', '1987/12/24']} 
#딕셔너리로 데이터프레임을 만들면 key가 컬럼명으로 들어감.
# 리스트를 데이터프레임을 만들면 행으로 입력됨

datas2 = [["홍 길동", "이 나영", "마 징가", "베 토벤"], 
         [10, 21, 73, 89],
         ['2000/01/23', '2020/11/08', '1999/5/4', '1987/12/24']]

(3) 데이터 저장 <hr>

In [3]:
# 딕셔너리 ===> 데이터프레임
df1=pd.DataFrame(datas)
df1

   name  age    reg_date
0  홍 길동   10  2000/01/23
1  이 나영   21  2020/11/08
2  마 징가   73    1999/5/4
3  베 토벤   89  1987/12/24

In [4]:
# 리스트 ===> 데이터프레임
df1=pd.DataFrame(datas2)
df1

            0           1         2           3
0        홍 길동        이 나영      마 징가        베 토벤
1          10          21        73          89
2  2000/01/23  2020/11/08  1999/5/4  1987/12/24

(4) 데이터 정보 확인 <hr>

In [5]:
# 데이터의 전체 기본 정보 => info()
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       3 non-null      object
 1   1       3 non-null      object
 2   2       3 non-null      object
 3   3       3 non-null      object
dtypes: object(4)
memory usage: 224.0+ bytes

(5) 데이터 전처리 <hr>

- (5-1) 행 <=> 열 치환 : T

In [6]:
df1 = df1.T
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       4 non-null      object
 1   1       4 non-null      object
 2   2       4 non-null      object
dtypes: object(3)
memory usage: 224.0+ bytes

In [7]:
df1.head()

      0   1           2
0  홍 길동  10  2000/01/23
1  이 나영  21  2020/11/08
2  마 징가  73    1999/5/4
3  베 토벤  89  1987/12/24

In [8]:
# 1번 컬럼 : object => 정수
df1[1] = df1[1].astype('uint8') # uint ----> 부호가 붙어있지 않은 숫자. # 64면 8바이트

In [9]:
df1.dtypes

0    object
1     uint8
2    object
dtype: object

In [10]:
# 2번 컬럼 : object => datetime64[ns]
df1[2]=df1[2].astype('datetime64[ns]')
df1

      0   1          2
0  홍 길동  10 2000-01-23
1  이 나영  21 2020-11-08
2  마 징가  73 1999-05-04
3  베 토벤  89 1987-12-24

In [11]:
df1.dtypes

0            object
1             uint8
2    datetime64[ns]
dtype: object

(5-3) 0번 컬럼의 이름을 성과 이름으로 분리.

In [12]:
#0번 컬럼만 추출 => Series
nameSR = df1[0]
nameSR

0    홍 길동
1    이 나영
2    마 징가
3    베 토벤
Name: 0, dtype: object

In [13]:
# '이 나영' 데이터를 추출 => 성과 이름으로 분리
type(nameSR[1]), nameSR[1].upper(), nameSR[1].split()

(str, '이 나영', ['이', '나영'])

In [14]:
#nameSR[1].split()

In [15]:
# for idx in range(nameSR.shape[0]) :
#     nameSR[idx] = nameSR[idx].split()
# nameSR

In [16]:
namesDF = nameSR.str.split(expand=True)

In [17]:
df1, namesDF

(      0   1          2
 0  홍 길동  10 2000-01-23
 1  이 나영  21 2020-11-08
 2  마 징가  73 1999-05-04
 3  베 토벤  89 1987-12-24,
    0   1
 0  홍  길동
 1  이  나영
 2  마  징가
 3  베  토벤)

- (5-4) 두 개의 DataFrame을 컬럼 방향으로 연결.

In [18]:
pd.concat([df1, namesDF]) #기본값은 행으로 연결. / 컬럼이 같은 곳에 들어감. 날짜/시간 컬럼이 없어서 NaT(Not A Time)로 채워짐.

      0   1          2
0  홍 길동  10 2000-01-23
1  이 나영  21 2020-11-08
2  마 징가  73 1999-05-04
3  베 토벤  89 1987-12-24
0     홍  길동        NaT
1     이  나영        NaT
2     마  징가        NaT
3     베  토벤        NaT

In [19]:
pd.concat([df1, namesDF], axis = 'columns', ignore_index=True) 
# 값을 컬럼으로 설정. axis =1로 설정해도 됨. / ignore_index = True : 원래 있던 인덱스를 무시하고 새로 설정.

      0   1          2  3   4
0  홍 길동  10 2000-01-23  홍  길동
1  이 나영  21 2020-11-08  이  나영
2  마 징가  73 1999-05-04  마  징가
3  베 토벤  89 1987-12-24  베  토벤

- (5-5) 2번 컬럼에서 년, 월, 일을 분리

In [20]:
df1[2]

0   2000-01-23
1   2020-11-08
2   1999-05-04
3   1987-12-24
Name: 2, dtype: datetime64[ns]

In [21]:
yearSR = df1[2].dt.year

In [22]:
monthSR = df1[2].dt.month

In [23]:
daySR = df1[2].dt.day

In [24]:
pd.concat([df1, yearSR], axis = 1, ignore_index=True) #

      0   1          2     3
0  홍 길동  10 2000-01-23  2000
1  이 나영  21 2020-11-08  2020
2  마 징가  73 1999-05-04  1999
3  베 토벤  89 1987-12-24  1987

- (5-6) 현재 DataFrame을 파일로 저장하기 => pandas.to_XXX("파일경로+파일명")

In [25]:
#csv => 데이터와 데이터의 구분자
filename = './backup.csv'              # 현재위치에 저장시 '파일명.csv'만 작성.

In [30]:
df1.to_csv(filename, sep=" ", header = False, index = False) # 구분자 공백. header = False : 헤더 없어짐./ index = False 인덱스 없어짐.

In [32]:
pd.read_csv(filename, header=None, sep=" ")

      0   1           2
0  홍 길동  10  2000-01-23
1  이 나영  21  2020-11-08
2  마 징가  73  1999-05-04
3  베 토벤  89  1987-12-24

구성 형태와 속성이 균일하다면 행 또는 열중에 어느 한 방향으로 이어붙이는 것. -> 일관성 유지.

<파라미터>

axis = 0 인덱스(axis = 'index')

axis = 1 컬럼(axis = 'columns')

join ='outer' ----> 열 이름 합집합

keys =[] ----> 행/열 이름 재정의